zephyrproject-rtos/hal_nxp/mcux/drivers/imxrt6xx/fsl_i3c.c
    if (transfer->busType != kI3C_TypeI3CDdr)
    {
        direction = (0UL != transfer->subaddressSize) ? kI3C_Write : transfer->direction;
    }

    if (0UL == (transfer->flags & (uint32_t)kI3C_TransferNoStartFlag))
    {
        result = I3C_MasterStart(base, transfer->busType, transfer->slaveAddress, direction,
                                 direction == kI3C_Write ? 0UL : transfer->dataSize);
        /* Wait tx fifo empty. */
        size_t txCount = 0xFFUL;

        while (txCount != 0U)
        {
            I3C_MasterGetFifoCounts(base, NULL, &txCount);
        }

        /* Check if device request wins arbitration. */
        if (0UL != (I3C_MasterGetStatusFlags(base) & (uint32_t)kI3C_MasterArbitrationWonFlag))
        {
            return kStatus_I3C_IBIWon;
        }
    }

    /* Subaddress, MSB first. */
    if (0U != transfer->subaddressSize)
    {
        uint32_t subaddressRemaining = transfer->subaddressSize;
        while (0UL != subaddressRemaining--)
        {
            uint8_t subaddressByte = (uint8_t)((transfer->subaddress >> (8UL * subaddressRemaining)) & 0xFFUL);

            result = I3C_MasterWaitForTxReady(base, 1U);

            if ((0UL == subaddressRemaining) && (transfer->direction == kI3C_Read) &&
                (transfer->busType != kI3C_TypeI3CDdr))
            {
                base->MWDATABE = subaddressByte;
                result         = I3C_MasterWaitForComplete(base, false);
                if (kStatus_Success != result)
                {
                    return result;
                }
            }
            else
            {
                base->MWDATAB = subaddressByte;
            }
        }
        /* Need to send repeated start if switching directions to read. */
        if ((transfer->busType != kI3C_TypeI3CDdr) && (0UL != transfer->dataSize) && (transfer->direction == kI3C_Read))
        {
            result =
                I3C_MasterRepeatedStart(base, transfer->busType, transfer->slaveAddress, kI3C_Read, transfer->dataSize);
            if (kStatus_Success != result)
            {
                return result;
            }
        }
    }

    /* Transmit data. */
    if ((transfer->direction == kI3C_Write) && (transfer->dataSize > 0UL))
    {
        /* Send Data. */
        result = I3C_MasterSend(base, transfer->data, transfer->dataSize, transfer->flags);
    }
    /* Receive Data. */
    else if ((transfer->direction == kI3C_Read) && (transfer->dataSize > 0UL))
    {
        result = I3C_MasterReceive(base, transfer->data, transfer->dataSize, transfer->flags);
    }
    else
    {
        /* Empty else to fix MISRA 15.7*/
    }

    return result;
}

/*!
 * brief Creates a new handle for the I3C master non-blocking APIs.
 *
 * The creation of a handle is for use with the non-blocking APIs. Once a handle
 * is created, there is not a corresponding destroy handle. If the user wants to
 * terminate a transfer, the I3C_MasterTransferAbort() API shall be called.
 *
 *
 * note The function also enables the NVIC IRQ for the input I3C. Need to notice
 * that on some SoCs the I3C IRQ is connected to INTMUX, in this case user needs to
 * enable the associated INTMUX IRQ in application.
 *
 * param base The I3C peripheral base address.
 * param[out] handle Pointer to the I3C master driver handle.
 * param callback User provided pointer to the asynchronous callback function.
 * param userData User provided pointer to the application callback data.
 */
void I3C_MasterTransferCreateHandle(I3C_Type *base,
                                    i3c_master_handle_t *handle,
                                    i3c_master_transfer_callback_t callback,
                                    void *userData)
{
    uint32_t instance;

    assert(NULL != handle);

    /* Clear out the handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Look up instance number */
    instance = I3C_GetInstance(base);

    /* Save base and instance. */
    handle->completionCallback = callback;
    handle->userData           = userData;

    /* Save this handle for IRQ use. */
    s_i3cMasterHandle[instance] = handle;

    /* Set irq handler. */
    s_i3cMasterIsr = I3C_MasterTransferHandleIRQ;

    /* Clear internal IRQ enables and enable NVIC IRQ. */
    I3C_MasterDisableInterrupts(base, (uint32_t)kMasterIrqFlags);

    /* Enable NVIC IRQ, this only enables the IRQ directly connected to the NVIC.
     In some cases the I3C IRQ is configured through INTMUX, user needs to enable
     INTMUX IRQ in application code. */
    (void)EnableIRQ(kI3cIrqs[instance]);
}

static status_t I3C_RunTransferStateMachine(I3C_Type *base, i3c_master_handle_t *handle, bool *isDone)
{
    uint32_t status;
    uint32_t errStatus;
    status_t result = kStatus_Success;
    i3c_master_transfer_t *xfer;
    size_t txCount;
    size_t rxCount;
    size_t txFifoSize =
        2UL << ((base->SCAPABILITIES & I3C_SCAPABILITIES_FIFOTX_MASK) >> I3C_SCAPABILITIES_FIFOTX_SHIFT);
    bool state_complete = false;
    i3c_puint8_to_u32_t dataBuff;

    /* Set default isDone return value. */
    *isDone = false;

    /* Check for errors. */
    status    = I3C_MasterGetStatusFlags(base);
    errStatus = I3C_MasterGetErrorStatusFlags(base);
    result    = I3C_MasterCheckAndClearError(base, errStatus);
    if (kStatus_Success != result)
    {
        return result;
    }

    if (0UL != (status & (uint32_t)kI3C_MasterArbitrationWonFlag))
    {
        handle->state = (uint8_t)kIBIWonState;
    }

    /* Get pointer to private data. */
    xfer = &handle->transfer;

    /* Get fifo counts and compute room in tx fifo. */
    I3C_MasterGetFifoCounts(base, &rxCount, &txCount);
    txCount = txFifoSize - txCount;

    while (!state_complete)
    {
        /* Execute the state. */
        switch (handle->state)
        {
            case (uint8_t)kIBIWonState:
                if ((base->MCTRL & I3C_MCTRL_IBIRESP_MASK) == I3C_MCTRL_IBIRESP(kI3C_IbiRespManual))
                {
                    if (((base->MSTATUS & I3C_MSTATUS_STATE_MASK) == (uint32_t)kI3C_MasterStateIbiAck) &&
                        (0UL != (status & (uint32_t)kI3C_MasterControlDoneFlag)))
                    {
                        /* Configure IBI response type. */
                        base->MCTRL    = I3C_MCTRL_IBIRESP(kI3C_IbiRespAck) | I3C_MCTRL_REQUEST(kI3C_RequestIbiAckNack);
                        state_complete = true;
                    }
                }
                else
                {
                    /* Make sure there is data in the rx fifo. */
                    if (0UL != rxCount)
                    {
                        /* Read byte from fifo. */
                        handle->ibiBuff[handle->ibiPayloadSize++] = (uint8_t)base->MRDATAB;
                        rxCount--;
                        break;
                    }
                    else if (0UL != (status & (uint32_t)kI3C_MasterCompleteFlag))
                    {
                        handle->ibiAddress =
                            (uint8_t)((status & I3C_MSTATUS_IBIADDR_MASK) >> I3C_MSTATUS_IBIADDR_SHIFT);
                        state_complete = true;
                        (void)I3C_MasterEmitStop(base, false);
                        result = kStatus_I3C_IBIWon;
                    }
                    else
                    {
                        state_complete = true;
                    }
                }
                break;

            case (uint8_t)kSendCommandState:
            {
                /* Make sure there is room in the tx fifo for the next command. */
                if (0UL == txCount--)
                {
                    state_complete = true;
                    break;
                }
                if (xfer->subaddressSize > 1U)
                {
                    xfer->subaddressSize--;
                    base->MWDATAB = (uint8_t)((xfer->subaddress) >> (8U * xfer->subaddressSize));
                }
                else if (xfer->subaddressSize == 1U)
                {
                    xfer->subaddressSize--;
                    if (xfer->direction == kI3C_Write)
                    {
                        base->MWDATAB = (uint8_t)((xfer->subaddress) >> (8U * xfer->subaddressSize));
                    }
                    else
                    {
                        base->MWDATABE = (uint8_t)((xfer->subaddress) >> (8U * xfer->subaddressSize));
                    }
                    if ((xfer->busType != kI3C_TypeI3CDdr) && (xfer->direction == kI3C_Read))
                    {
                        handle->state = (uint8_t)kWaitRepeatedStartCompleteState;
                        break;
                    }
                }
                else
                {
                    if (xfer->direction == kI3C_Write)
                    {
                        /* Send first byte of data. */
                        if (xfer->dataSize > 0U)
                        {
                            /* Next state, send data. */
                            handle->state   = (uint8_t)kTransferDataState;
                            dataBuff.puint8 = (uint8_t *)xfer->data;
                            base->MWDATAB   = *dataBuff.puint8;
                            dataBuff.u32    = dataBuff.u32 + 1U;
                            xfer->data      = (void *)dataBuff.puint8;
                            xfer->dataSize--;
                            --handle->remainingBytes;
                        }
                        else
                        {
                            *isDone = true;
                        }
                    }
                    else
                    {
                        /* Next state, receive data begin. */
                        handle->state = (uint8_t)kTransferDataState;
                    }
                }
                break;
            }

