zephyrproject-rtos/hal_nxp/mcux/drivers/imxrt6xx/fsl_i3c.c
    xfer = &handle->transfer;

    /* Get status flags. */
    flags    = I3C_SlaveGetStatusFlags(base);
    errFlags = I3C_SlaveGetErrorStatusFlags(base);

    pendingInts = I3C_SlaveGetPendingInterrupts(base);

    /* Get fifo counts and compute room in tx fifo. */
    I3C_SlaveGetFifoCounts(base, &rxCount, &txCount);
    txCount = txFifoSize - txCount;

    if (0UL != (errFlags & (uint32_t)kSlaveErrorFlags))
    {
        xfer->event            = (uint32_t)kI3C_SlaveCompletionEvent;
        xfer->completionStatus = I3C_SlaveCheckAndClearError(base, errFlags);

        if ((0UL != (handle->eventMask & (uint32_t)kI3C_SlaveCompletionEvent)) && (NULL != handle->callback))
        {
            handle->callback(base, xfer, handle->userData);
        }
        return;
    }

    /* Clear status flags. */
    I3C_SlaveClearStatusFlags(base, flags);

    if (0UL != (flags & (uint32_t)kI3C_SlaveBusStartFlag))
    {
        base->SDATACTRL |= I3C_SDATACTRL_FLUSHTB_MASK | I3C_SDATACTRL_FLUSHFB_MASK;
        xfer->txDataSize = 0;
        I3C_SlaveEnableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);
        pendingInts |= (uint32_t)kI3C_SlaveTxReadyFlag;
    }

    if (0UL != (flags & (uint32_t)kI3C_SlaveBusStopFlag))
    {
        I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);
        if (handle->isBusy == true)
        {
            xfer->event            = (uint32_t)kI3C_SlaveCompletionEvent;
            xfer->completionStatus = kStatus_Success;
            xfer->transferredCount = handle->transferredCount;
            handle->isBusy         = false;

            if (handle->wasTransmit)
            {
                /* Subtract one from the transmit count to offset the fact that I3C asserts the */
                /* tx flag before it sees the nack from the master-receiver, thus causing one more */
                /* count that the master actually receives. */
                --xfer->transferredCount;
                handle->wasTransmit = false;
            }

            if ((0UL != (handle->eventMask & xfer->event)) && (NULL != handle->callback))
            {
                handle->callback(base, xfer, handle->userData);
            }

            /* Clean up transfer info on completion, after the callback has been invoked. */
            (void)memset(&handle->transfer, 0, sizeof(handle->transfer));
        }
        else
        {
            return;
        }
    }

    if (0UL != (flags & (uint32_t)kI3C_SlaveMatchedFlag))
    {
        xfer->event    = (uint32_t)kI3C_SlaveAddressMatchEvent;
        handle->isBusy = true;
        if ((0UL != (handle->eventMask & (uint32_t)kI3C_SlaveAddressMatchEvent)) && (NULL != handle->callback))
        {
            handle->callback(base, xfer, handle->userData);
        }
    }

    /* Handle transmit and receive. */
    if ((0UL != (flags & (uint32_t)kI3C_SlaveTxReadyFlag)) && (0UL != (pendingInts & (uint32_t)kI3C_SlaveTxReadyFlag)))
    {
        handle->wasTransmit = true;

        /* If we're out of data, invoke callback to get more. */
        if ((NULL == xfer->txData) || (0UL == xfer->txDataSize))
        {
            xfer->event = (uint32_t)kI3C_SlaveTransmitEvent;
            if (0UL != (flags & (uint32_t)kI3C_SlaveBusHDRModeFlag))
            {
                xfer->event |= (uint32_t)kI3C_SlaveHDRCommandMatchEvent;
            }
            if (NULL != handle->callback)
            {
                handle->callback(base, xfer, handle->userData);
            }

            /* Clear the transferred count now that we have a new buffer. */
            handle->transferredCount = 0;
        }

        /* Transmit a byte. */
        while ((xfer->txDataSize != 0UL) && (txCount != 0U))
        {
            if (xfer->txDataSize > 1UL)
            {
                base->SWDATAB = *xfer->txData++;
            }
            else
            {
                base->SWDATABE = *xfer->txData++;
                I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);
            }
            --xfer->txDataSize;
            ++handle->transferredCount;
            txCount--;
        }
    }
    if (0UL != (flags & (uint32_t)kI3C_SlaveRxReadyFlag))
    {
        /* If we're out of room in the buffer, invoke callback to get another. */
        if ((NULL == xfer->rxData) || (0UL == xfer->rxDataSize))
        {
            xfer->event = (uint32_t)kI3C_SlaveReceiveEvent;
            if (0UL != (flags & (uint32_t)kI3C_SlaveBusHDRModeFlag))
            {
                xfer->event |= (uint32_t)kI3C_SlaveHDRCommandMatchEvent;
            }
            if (NULL != handle->callback)
            {
                handle->callback(base, xfer, handle->userData);
            }
            handle->transferredCount = 0;
        }

        /* Receive a byte. */
        while ((rxCount != 0U) && ((xfer->rxData != NULL) && (xfer->rxDataSize != 0UL)))
        {
            *xfer->rxData++ = (uint8_t)base->SRDATAB;
            --xfer->rxDataSize;
            ++handle->transferredCount;
            rxCount--;
        }
    }
}

static void I3C_CommonIRQHandler(I3C_Type *base, uint32_t instance)
{
    /* Check for master IRQ. */
    if (((uint32_t)kI3C_MasterOn == (base->MCONFIG & I3C_MCONFIG_MSTENA_MASK)) && (NULL != s_i3cMasterIsr))
    {
        /* Master mode. */
        s_i3cMasterIsr(base, s_i3cMasterHandle[instance]);
    }

    /* Check for slave IRQ. */
    if ((I3C_SCONFIG_SLVENA_MASK == (base->SCONFIG & I3C_SCONFIG_SLVENA_MASK)) && (NULL != s_i3cSlaveIsr))
    {
        /* Slave mode. */
        s_i3cSlaveIsr(base, s_i3cSlaveHandle[instance]);
    }
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}

#if defined(I3C)
/* Implementation of I3C handler named in startup code. */
void I3C0_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C, 0);
}
#endif

#if defined(I3C0)
/* Implementation of I3C0 handler named in startup code. */
void I3C0_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C0, 0);
}
#endif

#if defined(I3C1)
/* Implementation of I3C1 handler named in startup code. */
void I3C1_DriverIRQHandler(void)
{
    I3C_CommonIRQHandler(I3C1, 1);
}
#endif
